Autodesk.Revit.DB.FabricationPart.ResetPartGuid
force new part GUID
Since:
2016

Autodesk.Revit.DB.FabricationPart.IsStraightLengthStandard
Checks if the straight part's length is standard. For machine cut part, False will be returned.
Returns:
True if the straight part's length is standard.
Since:
2016

Autodesk.Revit.DB.FabricationPart.FixDuplicateGUIDs(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Eliminate duplicate part GUIDs by assiging new GUIDs to parts with duplicated ones.
Remarks:
Tries to change the parts that are last in the list.
If later parts can't be changed then earlier parts will be changed if possible.
document:
The document.
ids:
List of element Ids of fabrication parts to check.
Returns:
Returns a list of fabrication part element Ids that were changed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.IsSameAs(Autodesk.Revit.DB.FabricationPart,System.Collections.Generic.IList{Autodesk.Revit.DB.Fabrication.FabricationPartCompareType})
Compare this fabrication part with the part passed and checks the pattern dimensions and options. A list of fields that can be ignored in the comparison check can be specified.
part:
The part to compare this part with.
ignoreFields:
Array of types of data to ignore from the comparison check.
Returns:
Returns true if the fabrication parts are the same.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.FabricationPart.AddPartCustomData(System.Int32)
Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration.
Remarks:
The custom id must be positive.
customId:
The identifier of the custom data field to add.
Returns:
Returns true if the type was not already present.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data identifier does not exist.
Since:
2018

Autodesk.Revit.DB.FabricationPart.SetPartCustomDataText(System.Int32,System.String)
Set the custom data real value for the specified custom data.
customId:
The identifier of the custom data field to set.
value:
The text value of the custom data. If the data is not a text type the value will be parsed according to the fabrication confifuration rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist on the part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.RotateConnectedPartByConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,System.Double)
Rotates a connected fabrication part around the axis of the specified connector.
Remarks:
Attempts to resize rectangular and oval ends if the angle is a multiple of PI/2.
Taps cannot be rotated.
For rectangular and oval profiles only 90, 180 and 270 degree rotations are valid.
document:
The document.
connector:
The connected connector of the fabrication part to be rotated.
axisRotationBy:
The angle in radians to rotate by.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The connector does not belong to a fabrication part.
-or-
Connector is not connected.
-or-
Connector belongs to a fabrication part tap.
-or-
Fabrication part cannot be rotated because it is either unable to be re-sized or it is too constrained.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rotate failed because the fabrication part geometry could not be modified accordingly.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.PlaceFittingAsCutIn(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Connector,System.Double)
Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
document:
The document.
straightId:
Identifier of the straight to be cut in.
fittingId:
Identifier of the fitting to cut in.
position:
The position to cut in the straight.
fittingConnector:
The connector of the fitting to align with the primary connector of the straight part.
axisRotation:
Rotation around the direction of connection - angle between width vectors in radians.
Returns:
True if cuts in successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The fitting connector is not a connector of the fitting.
-or-
The fitting connector is not valid, it is not within a pair connector for cutting in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to align fitting to the straight to cut in.
-or-
There is no enough room in the run for cut in.
Since:
2017

Autodesk.Revit.DB.FabricationPart.PlaceAsTap(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double,System.Double,System.Double)
Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
Remarks:
Tap cannot be placed if it is already connected.
document:
The document.
tapPartConnector:
The connector of the part to place.
hostPartConnector:
The connector of host part.
distance:
The distance to host part connector where to place the part.
axisRotation:
The axis rotation in radians.
secondaryAxisRotation:
The secondary axis rotation in radians.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid part to place as tap.
-or-
Tap should be placed on straight part.
-or-
The distance is out of range.
-or-
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
Invalid tap for host's profile type.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
tap is not connected by its primary connector.
Throws Autodesk::Revit::Exceptions::InvalidOpertationException:
tap does not fit on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.RotateConnectedTap(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationPart,System.Double,System.Double)
Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
document:
The document.
tap:
The connected fabrication part tap to rotate.
primaryAxisRotateBy:
The primary axis rotation angle in radians to rotate by.
secondaryAxisRotateBy:
The secondary axis rotation angle in radians to rotate by.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Is not connected as a fabrication part tap.
-or-
tap cannot be rotated about the primary axis by the specified angle: primaryAxisRotateBy
-or-
tap cannot be rotated about the secondary axis by the specified angle: secondaryAxisRotateBy
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.AlignPartByInsertionPointAndCutInToStraight(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Boolean)
Align the part by its insertion point to a point and rotation on a straight. This will automatically size and connect the part being cut into, if possible.
document:
The document.
straightId:
The element identifier of the straight to be cut in to.
partId:
The element identifier of the part to align and cut in with.
position:
The position to move the parts insertion point to.
rotation:
The rotation in radians.
slope:
The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied
to fittings, whilst straights will inherit the slope from the piece it is connecting to.
flip:
Flip the part to allow for flow direction.
Returns:
True if the alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element is not a fabrication part.
-or-
Not all of the fabrication part's connectors are open.
-or-
The part is not a straight.
-or-
The fabrication parts do not have matching domain types.
-or-
The position is not on the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to align the part to the straight to cut in to.
Since:
2018

Autodesk.Revit.DB.FabricationPart.AlignPartByConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Fabrication.FabricationPartJustification,Autodesk.Revit.DB.Transform)
Align the part by its connector to a point and rotation in free space.
document:
The document.
connector:
The connector to align in free space.
position:
The position to move the connector to.
rotation:
The rotation in radians.
rotationPerpendicular:
The perpendicular rotation for free placement around the Y axis direction of connection - angle in radians.
slope:
The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied
to fittings, whilst straights will inherit the slope from the piece it is connecting to.
justification:
The justification to align eccentric parts.
trf:
Optional alignment transformation matrix, eg. a Trf that describes plan or side elevation.
Returns:
True if the alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The connector does not belong to a fabrication part.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.FabricationPart.AlignPartByInsertionPoint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Fabrication.FabricationPartJustification,Autodesk.Revit.DB.Transform)
Align the part by its insertion point to a point and rotation in free space.
document:
The document.
partId:
The element identifier of the part to align.
position:
The position to move the part's insertion point to.
rotation:
The rotation in radians.
rotationPerpendicular:
The perpendicular rotation for free placement around the Y axis direction of connection - angle in radians.
slope:
The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied
to fittings, whilst straights will inherit the slope from the piece it is connecting to.
justification:
The justification to align eccentric parts.
trf:
Optional alignment transformation matrix, eg. a Trf that describes plan or side elevation.
Returns:
True if the alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element is not a fabrication part.
-or-
Not all of the fabrication part's connectors are open.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.FabricationPart.AlignPartByConnectorToConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double,System.Double,Autodesk.Revit.DB.Fabrication.FabricationPartJustification)
Align a part by its connector to another connector. This will replace the FabricationPart::AlignPartByConnectors method.
document:
The document.
connector:
The connector of the fabrication part to move by in free space.
fixedConnector:
The connector for the fabrication part or family connector to align to.
rotation:
The rotation in radians.
slope:
The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied
to fittings, whilst straights will inherit the slope from the piece it is connecting to.
justification:
The justification to align eccentric parts.
Returns:
True if the alignment succeeds, false otherwise and the part will not move from the original position.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The connector does not belong to a fabrication part.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.FabricationPart.AlignPartByConnectors(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double)
Moves fabrication part by one of its connectors and aligns it to another connector.
document:
The document.
connector:
The connector of the fabrication part to move and align by.
toConnector:
The connector of the fabrication part or family to align to.
axisRotation:
Rotation around the direction of connection - angle between width vectors in radians.
Returns:
True if alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The connector does not belong to a fabrication part.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.ConnectAndCouple(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Makes a connection between the specified connectors and adds coupling if necessary.
Remarks:
This function does not place and align the fabrication part. Call AlignPartByConnectors before connecting.
document:
The document.
connector:
The connector of the fabrication part.
toConnector:
The connector of the fabrication part or family to connect to.
Returns:
True if connection succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The connector does not belong to a fabrication part.
-or-
The fabrication part connectors are not aligned, call AlignPartByConnectors to align them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.Flip
Flips the fabrication part that is directionally oriented (tees, crosses, valves, dampers, etc.) to the opposite direction.
Remarks:
Existing connections will be maintained, disconnect warnings will be posted if the connection cannot be maintained.
Returns:
Returns true if successful otherwise false if the fabrication part cannot be flipped.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
It is not a valid part that can be flipped.
Since:
2023

Autodesk.Revit.DB.FabricationPart.CanFlipPart
Validates if the fabrication part is one of the supported fabrication part types that can be flipped.
Returns:
Returns true if valid otherwise false if the fabrication part cannot be flipped.
Since:
2023

Autodesk.Revit.DB.FabricationPart.SplitStraight(Autodesk.Revit.DB.XYZ)
Splits the straight into two at the passed in point.
position:
The position to split in the straight.
Returns:
Returns the element identifier of the new straight.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The position is not on the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The part is not a straight.
Since:
2018

Autodesk.Revit.DB.FabricationPart.SplitStraight(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Splits the straight into two at the passed in point.
document:
The document.
partId:
Identifier of the straight to split.
position:
The position to split in the straight.
Returns:
Returns the element identifier of the new straight.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The part is not a straight.
-or-
The position is not on the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.CanSplitStraight(Autodesk.Revit.DB.XYZ)
Validates if the straight can be split into two at the passed in point.
position:
The position to split in the straight.
Returns:
Returns true if valid otherwise false if the straight cannot be split.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.FabricationPart.Reposition(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Repositions the fabrication straight part to another end of the run.
document:
The document.
partId:
Identifier of the fabrication part to reposition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a straight segment on the end in the run.
-or-
There are locked parts in the run.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2017

Autodesk.Revit.DB.FabricationPart.OptimizeLengths(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Optimizes the length fabrication straight parts.
document:
The document.
partIds:
The identifiers of the fabrication parts in a selected fabrication part run.
Returns:
New and modified fabrication part ids in the optimize
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no straight parts to optimize, or all parts are locked or locked by group membership.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationPart.AdjustEndLength(Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Adjusts the length for the specified connector.
connector:
# The connector of the fabrication part to adjust length.
lengthToAdjust:
The length to adjust.
totalLengthOnly:
True if adjust the total length only when adjust length.
Returns:
The adjusted length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end of the fabrication part of the connector can not be adjusted.
-or-
Connector is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FabricationPart.CanAdjustEndLength(Autodesk.Revit.DB.Connector)
Checks if the end of fabrication part can be adjusted.
connector:
The connector of the fabrication part to adjust length.
Returns:
True if the end of fabrication part can be adjusted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FabricationPart.SetCalculatedDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition,System.String)
Sets the calculated dimension value.
Remarks:
Multiple dimensions may need to be set in order to reach the desired outcome.
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
dim:
The fabrication dimension.
value:
The calculated dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
value is not a valid calculated fabrication dimension value.
-or-
fabrication dimension is unable to be modified because it is locked or from a product list.
-or-
the fabrication dimension is unable to be modified because it will affect the geometry of a connected end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the fabrication dimension is unable to be modified because the fabrication part is connected to more than one object.
-or-
the fabrication dimension cannot be set to the option: value.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetCalculatedDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition)
Gets the calculated dimension value.
dim:
The fabrication dimension.
Returns:
The calculated dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetDimensionCalculatedOptions(Autodesk.Revit.DB.FabricationDimensionDefinition)
Gets the calculated options of the fabrication dimension.
dim:
The fabrication dimension.
Returns:
The calculated options of the fabrication dimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.IsDimensionCalculated(Autodesk.Revit.DB.FabricationDimensionDefinition)
Checks if the fabrication dimension is calculated.
dim:
The fabrication dimension.
Returns:
True if the fabrication dimension is calculated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.SetDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition,System.Double)
Sets the fabrication dimension value. The value is in Revit internal units.
Remarks:
Multiple dimensions may need to be set in order to reach the desired outcome.
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
dim:
The fabrication dimension.
newValue:
The dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fabrication dimension is unable to be modified because it is locked or from a product list.
-or-
the fabrication dimension is unable to be modified because it will affect the geometry of a connected end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the fabrication dimension is unable to be modified because the fabrication part is connected to more than one object.
-or-
the fabrication dimension cannot be set to the value: newValue.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition)
Gets the value of the fabrication dimension, returns value in Revit internal units.
dim:
The fabrication dimension.
Returns:
The dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.SetPositionByEnd(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.XYZ)
Positions the connector of the fabrication part element by the passed point.
connector:
The connector of the fabrication part element.
position:
The position to move to.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationPart.SaveAsFabricationJob(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.String,Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions)
Save fabrication parts to an MEP job that can be opened in the fabrication software.
Remarks:
Only fabrication MAJ files are supported.
document:
The document.
ids:
List of element Ids of fabrication parts or assemblies and group elements that contain fabrication parts to save. Non-fabrication part elements will be ignored.
filename:
The full path and filename of the fabrication job to save.
saveOptions:
Options for the save operation.
Returns:
Returns a list of fabrication part element Ids that were saved to the fabrication job.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the path to the filename must already exist and be writeable
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The destination file name includes one or more invalid characters.
Since:
2019

Autodesk.Revit.DB.FabricationPart.StretchAndFit(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId}@)
Stretch the fabrication part from the specified connector and fit to the target routing end.
Remarks:
Cannot stretch and fit fabrication part straight, tap or hanger.
document:
The document in which to perform the stretch and fit.
stretchConnector:
The connector of the fabrication part to be stretched.
target:
The target routing end to align and fit to.
newPartIds:
New fabrication part element identifiers.
Returns:
Returns FabricationPartFitResult::Success if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Connector does not belong to a fabrication part with a valid fabrication service.
-or-
Connector is connected.
-or-
Connector belongs to a fabrication part straight, tap, or hanger.
-or-
Routing end is valid to route to.
-or-
stretch target end type must be a supported type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
fabrication part is not connected at one end only.
-or-
cannot stretch fabrication part to a different service.
Since:
2017

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a free placed hanger.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
levelId:
The level identifier associated with the level.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Since:
2017

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Creates a hanger on the fabrication part.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
hostId:
The host part id. The host should be one horizontal straight part.
hostConnector:
The connector of the host.
distance:
The distance from the input connector of the host part. Units are in feet (ft).
attachToStructure:
Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Structural Framing.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Hangers may only be placed on straight horizontal fabrication segments and some kind of fittings.
-or-
Invalid fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the distance is out of range.
-or-
cannot find suitable fabrication part for the host.
-or-
cannot place hanger on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Creates a hanger on the fabrication part.
document:
The document.
button:
The fabrication service button to use. It finds the matching condition automatically if the button has multiple condition.
hostId:
The host part id. The host should be one horizontal straight part.
hostConnector:
The connector of the host.
distance:
The distance from the input connector of the host part. Units are in feet (ft).
attachToStructure:
Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Structure Framing.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Hangers may only be placed on straight horizontal fabrication segments and some kind of fittings.
-or-
Invalid fabrication service button.
-or-
The distance is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
cannot place hanger on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationItemFile,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element from a fabrication item file.
document:
The document.
itemFile:
The fabrication item file.
levelId:
The element identifier associated with the Autodesk.Revit.DB.Level
the Autodesk.Revit.DB.FabricationPart will be created on.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The item file is not valid for use in Revit.
-or-
The item file has not been loaded into the configuration.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index.
levelId:
The element identifier associated with the Autodesk.Revit.DB.Level
the Autodesk.Revit.DB.FabricationPart will be created on.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
-or-
Please use FabricationPart.CreateHanger to create fabrication hanger.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type does not exist. Reload the service using FabricationConfiguration.LoadServices.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Double,System.Double,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button and size.
document:
The document.
button:
The fabrication service button to use. Matches button condition based on the specified size.
width:
The width of the part. Units are in feet (ft).
depth:
The depth of the part. Units are in feet (ft). It should be equal to width for round part.
levelId:
The element identifier associated with the Autodesk.Revit.DB.Level
the Autodesk.Revit.DB.FabricationPart will be created on.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
-or-
Please use FabricationPart.CreateHanger to create fabrication hanger.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type does not exist. Reload the service using FabricationConfiguration.LoadServices.
-or-
failing to match a button condition based on specific size.
Since:
2016

Autodesk.Revit.DB.FabricationPart.SpoolName
The spool name of the fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2018

Autodesk.Revit.DB.FabricationPart.ItemNumber
The item number that is used for identification, re-ordering from shop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2017

Autodesk.Revit.DB.FabricationPart.MaterialGauge
The fabrication material gauge identifier.
Since:
2024

Autodesk.Revit.DB.FabricationPart.Notes
The notes of the fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2017